{
  "Comment.nvim": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
<<<<<<< HEAD
||||||| parent of a3495f9 (Change tsserver to ts_ls in lspconfig)
  "LuaSnip": { "branch": "master" },
=======
  "LuaSnip": { "branch": "master" },
>>>>>>> a3495f9 (Change tsserver to ts_ls in lspconfig)
  "cmp-buffer": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
||||||| parent of 04df592 (swap null-ls for none-ls)
||||||| 630be3b
  "LuaSnip": { "branch": "master" },
=======
  "LuaSnip": { "branch": "master" },
>>>>>>> origin/main
  "cmp-buffer": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
=======
  "cmp-buffer": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
>>>>>>> 04df592 (swap null-ls for none-ls)
  "cmp-nvim-lsp-signature-help": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "copilot.vim": { "branch": "release" },
  "fidget.nvim": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lspkind-nvim": { "branch": "master" },
<<<<<<< HEAD
||||||| parent of a3495f9 (Change tsserver to ts_ls in lspconfig)
  "gitsigns.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lspkind-nvim": { "branch": "master" },
=======
  "gitsigns.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lspkind-nvim": { "branch": "master" },
>>>>>>> a3495f9 (Change tsserver to ts_ls in lspconfig)
||||||| parent of 04df592 (swap null-ls for none-ls)
||||||| 630be3b
  "gitsigns.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lspkind-nvim": { "branch": "master" },
=======
  "gitsigns.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lspkind-nvim": { "branch": "master" },
>>>>>>> origin/main
=======
>>>>>>> 04df592 (swap null-ls for none-ls)
  "lualine-lsp-progress": { "branch": "master" },
<<<<<<< HEAD
<<<<<<< HEAD
  "lualine.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
||||||| parent of a3495f9 (Change tsserver to ts_ls in lspconfig)
  "lualine.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
=======
  "lualine.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
>>>>>>> a3495f9 (Change tsserver to ts_ls in lspconfig)
||||||| parent of 04df592 (swap null-ls for none-ls)
<<<<<<< HEAD
  "lualine.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
||||||| 630be3b
  "lualine.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
=======
  "lualine.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
>>>>>>> origin/main
=======
  "lualine.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
>>>>>>> 04df592 (swap null-ls for none-ls)
  "mason-null-ls.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "neo-tree.nvim": { "branch": "main" },
  "neoscroll.nvim": { "branch": "master" },
<<<<<<< HEAD
<<<<<<< HEAD
  "nui.nvim": { "branch": "main" },
||||||| parent of a3495f9 (Change tsserver to ts_ls in lspconfig)
  "mason.nvim": { "branch": "main" },
  "neo-tree.nvim": { "branch": "main" },
  "neoscroll.nvim": { "branch": "master" },
  "nui.nvim": { "branch": "main" },
=======
  "mason.nvim": { "branch": "main" },
  "neo-tree.nvim": { "branch": "main" },
  "neoscroll.nvim": { "branch": "master" },
  "nui.nvim": { "branch": "main" },
>>>>>>> a3495f9 (Change tsserver to ts_ls in lspconfig)
  "null-ls.nvim": { "branch": "main" },
<<<<<<< HEAD
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "phpactor": { "branch": "master" },
||||||| parent of a3495f9 (Change tsserver to ts_ls in lspconfig)
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "phpactor": { "branch": "master" },
=======
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "phpactor": { "branch": "master" },
>>>>>>> a3495f9 (Change tsserver to ts_ls in lspconfig)
||||||| parent of 04df592 (swap null-ls for none-ls)
  "nui.nvim": { "branch": "main" },
||||||| 630be3b
  "mason.nvim": { "branch": "main" },
  "neo-tree.nvim": { "branch": "main" },
  "neoscroll.nvim": { "branch": "master" },
  "nui.nvim": { "branch": "main" },
=======
  "mason.nvim": { "branch": "main" },
  "neo-tree.nvim": { "branch": "main" },
  "neoscroll.nvim": { "branch": "master" },
  "nui.nvim": { "branch": "main" },
>>>>>>> origin/main
  "null-ls.nvim": { "branch": "main" },
<<<<<<< HEAD
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "phpactor": { "branch": "master" },
||||||| 630be3b
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "phpactor": { "branch": "master" },
=======
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "phpactor": { "branch": "master" },
>>>>>>> origin/main
=======
||||||| parent of b0f84ae (add none-ls-extras)
=======
  "none-ls-extras.nvim": { "branch": "main" },
>>>>>>> b0f84ae (add none-ls-extras)
  "none-ls.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "phpactor": { "branch": "master" },
>>>>>>> 04df592 (swap null-ls for none-ls)
  "playground": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "schemastore.nvim": { "branch": "main" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "tokyonight.nvim": { "branch": "main" },
  "vim-eunuch": { "branch": "master" },
<<<<<<< HEAD
||||||| parent of a3495f9 (Change tsserver to ts_ls in lspconfig)
  "plenary.nvim": { "branch": "master" },
  "schemastore.nvim": { "branch": "main" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "tokyonight.nvim": { "branch": "main" },
  "vim-eunuch": { "branch": "master" },
=======
  "plenary.nvim": { "branch": "master" },
  "schemastore.nvim": { "branch": "main" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "tokyonight.nvim": { "branch": "main" },
  "vim-eunuch": { "branch": "master" },
>>>>>>> a3495f9 (Change tsserver to ts_ls in lspconfig)
||||||| parent of 04df592 (swap null-ls for none-ls)
||||||| 630be3b
  "plenary.nvim": { "branch": "master" },
  "schemastore.nvim": { "branch": "main" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "tokyonight.nvim": { "branch": "main" },
  "vim-eunuch": { "branch": "master" },
=======
  "plenary.nvim": { "branch": "master" },
  "schemastore.nvim": { "branch": "main" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "tokyonight.nvim": { "branch": "main" },
  "vim-eunuch": { "branch": "master" },
>>>>>>> origin/main
=======
>>>>>>> 04df592 (swap null-ls for none-ls)
  "vim-floaterm": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-sleuth": { "branch": "master" },
<<<<<<< HEAD
||||||| parent of a3495f9 (Change tsserver to ts_ls in lspconfig)
  "vim-fugitive": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-sleuth": { "branch": "master" },
=======
  "vim-fugitive": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-sleuth": { "branch": "master" },
>>>>>>> a3495f9 (Change tsserver to ts_ls in lspconfig)
||||||| parent of 04df592 (swap null-ls for none-ls)
||||||| 630be3b
  "vim-fugitive": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-sleuth": { "branch": "master" },
=======
  "vim-fugitive": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-sleuth": { "branch": "master" },
>>>>>>> origin/main
=======
>>>>>>> 04df592 (swap null-ls for none-ls)
  "vim-surround": { "branch": "master" },
  "vim-test": { "branch": "master" },
  "window-picker": { "branch": "main" }
}
<<<<<<< HEAD
||||||| parent of a3495f9 (Change tsserver to ts_ls in lspconfig)
  "vim-test": { "branch": "master" },
  "window-picker": { "branch": "main" }
}
=======
  "vim-test": { "branch": "master" },
  "window-picker": { "branch": "main" }
}
>>>>>>> a3495f9 (Change tsserver to ts_ls in lspconfig)
||||||| parent of 04df592 (swap null-ls for none-ls)
||||||| 630be3b
  "vim-test": { "branch": "master" },
  "window-picker": { "branch": "main" }
}
=======
  "vim-test": { "branch": "master" },
  "window-picker": { "branch": "main" }
}
>>>>>>> origin/main
=======
>>>>>>> 04df592 (swap null-ls for none-ls)
